pokemon_types = {
    "一般": "NORMAL",
    "草": "GRASS",
    "火": "FIRE",
    "水": "WATER",
    "电": "ELECTRIC",
    "飞行": "FLYING",
    '飛行': 'FLYING',
    "超能力": "PSYCHIC",
    "虫": "BUG",
    '蟲': 'BUG',
    "岩石": "ROCK",
    "幽灵": "GHOST",
    '幽靈': 'GHOST',
    "冰": "ICE",
    "龙": "DRAGON",
    '龍': 'DRAGON',
    "格斗": "FIGHT",
    '格鬥': 'FIGHT',
    "恶": "DARK",
    '惡': 'DARK',
    "毒": "POISON",
    "钢": "STEEL",
    '鋼': 'STEEL',
    "地面": "GROUND",
    "妖精": "FAIRY",
    "": "",
    None: None
}
egg_group_dict1 = {
    '怪兽': 'MONSTER',
    '水中1': 'WATER_1',
    '虫': 'BUG',
    '飞行': 'FLYING',
    '陆上': 'FIELD', '陸上': 'FIELD',
    '妖精': 'FAIRY',
    '植物': 'GRASS',
    '人型': 'HUMAN_LIKE',
    '水中3': 'WATER_3',
    '矿物': 'MINERAL', '礦物': 'MINERAL',
    '不定形': 'AMORPHOUS',
    '水中2': 'WATER_2',
    '百变怪': 'DITTO',
    '龙': 'DRAGON',
    '未发现': 'UNDISCOVERED',
    '性别不明': 'GENDER_UNKNOWN',
    None: 'UNDISCOVERED'
}
egg_group_dict2 = {
    '怪兽': 'MONSTER',
    '水中1': 'WATER_1',
    '虫': 'BUG',
    '飞行': 'FLYING',
    '陆上': 'FIELD', '陸上': 'FIELD',
    '妖精': 'FAIRY',
    '植物': 'GRASS',
    '人型': 'HUMAN_LIKE',
    '水中3': 'WATER_3',
    '矿物': 'MINERAL', '礦物': 'MINERAL',
    '不定形': 'AMORPHOUS',
    '水中2': 'WATER_2',
    '百变怪': 'DITTO',
    '龙': 'DRAGON',
    '未发现': 'UNDISCOVERED',
    '性别不明': 'GENDER_UNKNOWN',
    None: None
}
special_pokemon_form_name_map = {
    '喷火龙': {
        '超级喷火龙Ｘ': '超级喷火龙Ｘ',
        '超级喷火龙Ｙ': '超级喷火龙Ｙ'
    },
    '超梦': {
        '超级超梦Ｘ': '超级超梦Ｘ',
        '超级超梦Ｙ': '超级超梦Ｙ'
    },
    '乌波': {
        '帕底亚乌波': '一般的样子'
    },
    '千针鱼': {
        '千针鱼': '第七世代起，一般的样子'
    },
    '飘浮泡泡': {
        '飘浮泡泡的样子': '一般的样子',
        '太阳的样子': '一般的样子',
        '雨水的样子': '一般的样子',
        '雪云的样子': '一般的样子'
    },
    '结草儿': {
        '草木蓑衣': '一般的样子',
        '砂土蓑衣': '一般的样子',
        '垃圾蓑衣': '一般的样子'
    },
    '无壳海兔': {
        '西海': '一般的样子',
        '东海': '一般的样子',
    },
    '海兔兽': {
        '西海': '一般的样子',
        '东海': '一般的样子',
    },
    '巴大蝶': {
        '巴大蝶': '第六世代起',
        '超极巨化的样子': '第六世代起'
    },
    '野蛮鲈鱼': {
        '紅條紋的樣子': '一般的样子',
        '藍條紋的樣子': '一般的样子',
        '白条纹的樣子': '一般的样子',
    },
    '小拉达': {
        '小拉達': '一般的样子',
    },
    '皮卡丘': {
        '皮卡丘': '皮卡丘(第六世代起)',
        '换装皮卡丘': '皮卡丘(第六世代起)',
        '戴着帽子的皮卡丘': '皮卡丘(第六世代起)',
        '超极巨化的样子': '皮卡丘(第六世代起)'
    },
    '顽皮雷弹': {
        '顽皮雷弹': '第七世代起，一般的样子',
    },
    '伊布': {
        '超极巨化的样子': '普通伊布',
        '伊布': '普通伊布',
    },
    '洛托姆': {
        '加热洛托姆': '加热／清洗／结冰／旋转／切割洛托姆',
        '清洗洛托姆': '加热／清洗／结冰／旋转／切割洛托姆',
        '结冰洛托姆': '加热／清洗／结冰／旋转／切割洛托姆',
        '旋转洛托姆': '加热／清洗／结冰／旋转／切割洛托姆',
        '切割洛托姆': '加热／清洗／结冰／旋转／切割洛托姆',
    },
    '代欧奇希斯': {
        '普通形态': '一般形态'
    },
    '樱花儿': {
        '晴天形态': '晴天形态（传说 阿尔宙斯）'
    },
    '帝牙卢卡': {
        '帝牙卢卡': '通常'
    },
    '帕路奇亚': {
        '帕路奇亚': '通常'
    },
    '谢米': {
        '陆上形态': '陆地形态'
    },
    '达摩狒狒': {
        '达摩狒狒<br>（普通模式）': '普通模式',
        '达摩狒狒<br>（达摩模式）': '达摩模式',
        '伽勒尔达摩狒狒<br>（普通模式）': '伽勒尔的样子',
        '伽勒尔达摩狒狒<br>（达摩模式）': '伽勒尔的样子(达摩模式)'
    },
    '酋雷姆': {
        '酋雷姆的樣子': '酋雷姆'
    },
    '美洛耶塔': {
        '歌声形態': '歌声形态',
        '舞步形態': '舞步形态',
    },
    '甲贺忍蛙': {
        '甲贺忍蛙': '甲贺忍蛙',
        '小智版甲贺忍蛙': '小智版甲贺忍蛙'
    },
    '花叶蒂': {
        '红花': '各色花朵',
        '橙花': '各色花朵',
        '蓝花': '各色花朵',
        '白花': '各色花朵',
        '黄花': '各色花朵',
    },
    '坚盾剑怪': {
        '盾牌形态': '盾牌形态（第八世代）',
        '刀剑形态': '刀剑形态（第八世代）'
    },
    '基格尔德': {
        '１０％形態': '１０％形态',
        '５０％形態': '５０％形态',
        '完全體形態': '完全体形态'
    },
    '鬃岩狼人': {
        '白昼的样子': '白昼的样子',
        '黑夜的样子': '黑夜的样子',
        '黄昏的样子': '黄昏的样子'
    },
    '弱丁鱼': {
        '单独的样子': '单独的样子',
        '鱼群的样子': '鱼群的样子'
    },
    '小陨星': {
        '流星的样子': '外壳'
    },
    '无极汰那': {
        '无极汰那': '一般形态',
        '无极巨化的样子': '无极巨化'
    },
    '武道熊师': {
        '一击流超极巨化的样子': '一击流',
        '连击流超极巨化的样子': '连击流'
    },
}

game_code_to_generation_dict: dict[str, int] = {
    'LPLE': 7,
    'BDSP': 8,
    'HGSS': 4,
    'FRLG': 3,
    'ORAS': 6,
    'USUM': 7,
    'LA': 8
}

learn_set_table_column_mapping = {
    'yes': True,
    'no': False,
    '': False
}

DAMAGE_CATEGORY_MAP_DICT = {
    '物理': 'PHYSICAL',
    '特殊': 'SPECIAL',
    '变化': 'STATUS',
    '极巨': 'MAX',
    '超极巨': 'GIGANTAMAX',
    'Z': 'Z_MOVE'
}

BOOL_MAPPING_DICT = {
    'yes': True,
    'no': False,
    '': False,
    None: False
}
